system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application             interPhaseChangeFoam;

startFrom               latestTime;

startTime               0;

stopAt                  endTime;

endTime                 1.4;

deltaT                  1e-5;//2.5e-5

writeControl            adjustableRunTime;

writeInterval           0.001;

purgeWrite              0;

writeFormat             ascii;

writePrecision          6;

writeCompression        off;

timeFormat              general;

runTimeModifiable       yes;

adjustTimeStep          off;

maxCo                   5;//1
maxAlphaCo		2;

libs
    (
        "libincompressibleTurbulenceModels.so"
        "libcompressibleTurbulenceModels.so"
	"libturbulenceModels.so"
	"libturbulenceModelSchemes.so"
    );

functions
{
	#includeFunc	singleGraph
	  fieldAverage
  {
      type            fieldAverage;
      functionObjectLibs ( "libfieldFunctionObjects.so" );
      enabled         true;
      timeStart       0.0;
      timeEnd	      0.3;
      outputControl   outputTime;
 
      fields
    (
        U
        {
            mean        on;
            prime2Mean  on;
            base        time;
        }
        
        k
        {
            mean        on;
            prime2Mean  off;
            base        time;
        }
        alpha.water
        {
            mean        on;
            prime2Mean  on;
            base        time;
        }
	p
	{
	    mean	on;
	    prime2Mean  on;
	    base	time;
	}
    );
  }
	probes
    {
        type            probes;

        // Where to load it from
        functionObjectLibs ("libsampling.so");

        // Name of the directory for probe data
        name probes;

        // Write at every timestep
        outputControl   outputTime;

        // Fields to be probed
        fields
        (
            UMean
	    UPrime2Mean	
	    pMean
        );

        probeLocations
        (
        (0.7455787 0.05082 0) //LDV velocity probe
	(0.7426079 0.0512376 0) //pressure probe
	(1.38386   0.0381 0)   // Experimental pressure outflow probe
    	(0.73616   0.0381 0)   // Experimental velocity inflow probe
        );
    }
}

// ************************************************************************* //
