0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0];

internalField   uniform (8 0 0); //7.9

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
        //setAverage      true;
        //average         (8 0 0 );
    }

    outlet
    {
        type            pressureInletOutletVelocity;
	value		uniform (0 0 0);
    }

    topWall
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }

    bottomWall
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
   
}

// ************************************************************************* //
