0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.000001;//0.000000934;

boundaryField
{
    inlet
    {
        type            kqRWallFunction;
        nFaces          50;
        startFace       9850;
	value		1;
    }
    outlet
    {
        type		kqRWallFunction;
        nFaces          50;
        startFace       9900;
	value		1;
    }
    topWall
    {
        type            nutkWallFunction;
	value		uniform 0;
        inGroups        1(wall);
        nFaces          100;
        startFace       9950;
    }
    bottomWall
    {
        type            nutkWallFunction;
	value		uniform 0;
        inGroups        1(wall);
        nFaces          100;
        startFace       10050;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          10000;
        startFace       10150;
    }
}


// ************************************************************************* //
