0/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];


internalField   uniform 1000;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 1000;
    }
    outlet
    {
        type            calculated;
        value           uniform 1000;
    }
    topWall
    {
        type            calculated;
        value           uniform 1000;
    }
    bottomWall
    {
        type            calculated;
        value           uniform 1000;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
