0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
400
(
0.558916
0.558916
0.558916
0.558916
0.558916
0.558916
0.558916
0.558916
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
400
(
0.558916
0.558916
0.558916
0.558916
0.558916
0.558916
0.558916
0.558916
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
