system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.water.*"
    {
        cAlpha          0;
        nAlphaCorr      4;
        nAlphaSubCycles 4;

        MULESCorr       yes;
        nLimiterIter    50;

        solver          PBiCG;
	preconditioner	DILU;
        tolerance       1e-8;//1e-8
        relTol          0;
    };

    "U.*"
    {
        solver           PBiCG;
        preconditioner	 DILU;
        tolerance        1e-8; //1e-6
        relTol           0;
    };

    "(k|omega)"
    {
        solver           PBiCG;
        preconditioner	 DILU;
        tolerance        1e-8; //1e-6
        relTol           0;
    };
 

    "(U|k|omega)Final"
    {
        solver           PBiCG;
	preconditioner	 DILU;
	tolerance	 1e-10; //1e-6
        relTol 		 0;
    }
    p_rgh
    {
        solver           GAMG;
        tolerance        1e-8; //1e-8
        relTol           0.1;

        smoother         DICGaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;

        cacheAgglomeration true;

        nCellsInCoarsestLevel 10;
        agglomerator     faceAreaPair;
        mergeLevels      1;

        maxIter          50;
    };

    nuTilda
    {
	solver		PBiCG;
	preconditioner	DILU;
	smoother	DICGaussSeidel;
	nSweeps		2;
	tolerance	1e-8;//1e-6
	relTol		0;
    };

     "pcorr.*"
    {
        $p_rgh;
        relTol           0;
    };

    p_rghFinal
  {
        solver            PCG;
	preconditioner
        {
            preconditioner  GAMG;

            tolerance        1e-10; //1e-6
            relTol           0;

            nVcycles         2;

            smoother         DICGaussSeidel;
            nPreSweeps       0;
            nPostSweeps      2;
            nFinestSweeps    2;

            cacheAgglomeration true;
            nCellsInCoarsestLevel 10;
            agglomerator     faceAreaPair;
            mergeLevels      1;
        };
        tolerance        1e-10; //1e-7. This is the main problem
        relTol           0;
        maxIter          50;
    };
}

PIMPLE
{
    momentumPredictor          yes;
    nOuterCorrectors           100;
    nCorrectors                3;
    nNonOrthogonalCorrectors   0;
    turbOnFinalIterOnly        false;
    residualControl  //outerCorrectorResidualControl
   	{
       	       "(p_rgh|U|alpha.water)"
		{
		 tolerance	1e-4;//5e-5
		 relTol 	 0;//0.1
		}
		"(k|omega)"
		{
		 tolerance	1e-4;//1e-4
		 relTol		0;
		}
    	}	
}


relaxationFactors
{
    fields
    {
	p		0.8;
	pFinal		0.8;
    }
    equations
    {
        U               0.8; // 0.9 is more stable but 0.95 more convergent
	UFinal		0.8;
        ".*"            0.8; // 0.9 is more stable but 0.95 more convergent
	k		0.8;
	kFinal		0.8;
	omega		0.8;
	omegaFinal	0.8;
    }
}

// ************************************************************************* //
